In [1]:
%load_ext sql
%sql sqlite:///PS1.db

Problem Set 1 [75 points]
=======

### Deliverables:

Submit your queries (and only those) using the `submission_template.txt` file that is posted on the class website. Follow the instructions on the file! Upload the file at Canvas (under PS1).


### Instructions / Notes:

* Run the top cell above to load the database `PS1.db` (make sure the database file, `PS1.db`, is in the same directory as this IPython notebook is running in)
* Some of the problems involve _changing_ this database (e.g. deleting rows)- you can always re-download `PS1.db` or make a copy if you want to start fresh!
* You **may** create new IPython notebook cells to use for e.g. testing, debugging, exploring, etc.- this is encouraged in fact!- **just make sure that your final answer for each question is _in its own cell_ and _clearly indicated_**
* When you see `In [*]:` to the left of the cell you are executing, this means that the code / query is _running_.
    * **If the cell is hanging- i.e. running for too long: To restart the SQL connection, you must restart the entire python kernel**
    * To restart kernel using the menu bar: "Kernel >> Restart >> Clear all outputs & restart"), then re-execute the sql connection cell at top
    * You will also need to restart the connection if you want to load a different version of the database file
* Remember:
    * `%sql [SQL]` is for _single line_ SQL queries
    * `%%sql [SQL]` is for _multi line_ SQL queries
* _Have fun!_

# Problem 1: Linear Algebra [25 points]
------------------------

Two random 3x3 ($N=3$) matrices have been provided in tables `A` and `B`, having the following schema:
> * `i INT`:   Row index
> * `j INT`:   Column index
> * `val INT`: Cell value

**Note: all of your answers below _must_ work for any _square_ matrix sizes, i.e. any value of $N$**.

Note how the matrices are represented - why do we choose this format?  Run the following queries to see the matrices in a nice format:

In [7]:
%sql SELECT * FROM A

 * sqlite:///PS1.db
Done.

[(0, 0, 7),
 (0, 1, 5),
 (0, 2, 8),
 (1, 0, 10),
 (1, 1, 7),
 (1, 2, 7),
 (2, 0, 2),
 (2, 1, 0),
 (2, 2, 5)]

In [2]:
%%sql
SELECT group_concat(val, " , ") AS "A" FROM A GROUP BY i;

 * sqlite:///PS1.db
Done.

[('7 , 5 , 8',), ('10 , 7 , 7',), ('2 , 0 , 5',)]

In [57]:
%%sql 
SELECT group_concat(val, " , ") AS "B" FROM B GROUP BY i;

 * sqlite:///PS1.db
Done.

[('9 , 6 , 10',), ('7 , 6 , 9',), ('1 , 1 , 7',)]

### Part (a): Matrix addition [5 points]

The sum of a matrix $A$ (having dimensions $n\times m$) and a matrix $B$ (having dimensions $n\times m$) is the matrix $C$ (of dimension $n\times m$) having cell at row $i$ and column $j$ equal to:

$C_{ij} = A_{ij} + B_{ij}$

Write a single SQL query to get the sum of $A$ and $B$ (in the same format as $A$ and $B$):

In [ ]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[(0, 0, 16),
 (0, 1, 11),
 (0, 2, 18),
 (1, 0, 17),
 (1, 1, 13),
 (1, 2, 16),
 (2, 0, 3),
 (2, 1, 1),
 (2, 2, 12)]

In [3]:
%%sql
SELECT A.i, A.j, A.val + B.val as Val
FROM A, B
WHERE A.i = B.i
AND A.j = B.j

 * sqlite:///PS1.db
Done.

[(0, 0, 16),
 (0, 1, 11),
 (0, 2, 18),
 (1, 0, 17),
 (1, 1, 13),
 (1, 2, 16),
 (2, 0, 3),
 (2, 1, 1),
 (2, 2, 12)]

### Part (b): Dot product [5 points]

The _dot product_ of two vectors

$a = \begin{bmatrix}a_1 & a_2 & \dots & a_n\end{bmatrix}$

and

$b = \begin{bmatrix}b_1 & b_2 & \dots & b_n\end{bmatrix}$

is

$a\cdot b = \sum_{i=1}^n a_ib_i = a_1b_1 + a_2b_2 + \dots + a_nb_n$

Write a _single SQL query_ to take the dot product of the **third column of $A$** and the **second column of $B$.**:

In [ ]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[(95,)]

In [16]:
%%sql
SELECT SUM(A.val * B.val)
FROM A, B
WHERE A.j = 2
AND B.j = 1
AND A.i = B.i

 * sqlite:///PS1.db
Done.

[(95,)]

In [47]:
%%sql
SELECT *
FROM A, B
GROUP BY A

 * sqlite:///PS1.db
(sqlite3.OperationalError) no such column: A
[SQL: SELECT * FROM A, B
GROUP BY A]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

### Part (c): Matrix multiplication [5 points]

The product of a matrix $A$ (having dimensions $n\times m$) and a matrix $B$ (having dimensions $m\times p$) is the matrix $C$ (of dimension $n\times p$) having cell at row $i$ and column $j$ equal to:

$C_{ij} = \sum_{k=1}^m A_{ik}B_{kj}$

In other words, to multiply two matrices, get each cell of the resulting matrix $C$, $C_{ij}$, by taking the _dot product_ of the $i$th row of $A$ and the $j$th column of $B$.

Write a single SQL query to get the matrix product of $A$ and $B$ (in the same format as $A$ and $B$):

In [ ]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(0, 0, 106),
 (0, 1, 80),
 (0, 2, 171),
 (1, 0, 146),
 (1, 1, 109),
 (1, 2, 212),
 (2, 0, 23),
 (2, 1, 17),
 (2, 2, 55)]

In [201]:
%%sql
SELECT *
FROM A,B
GROUP BY A.i, B.j

 * sqlite:///PS1.db
Done.

[(0, 0, 7, 0, 0, 9),
 (0, 0, 7, 0, 1, 6),
 (0, 0, 7, 0, 2, 10),
 (1, 0, 10, 0, 0, 9),
 (1, 0, 10, 0, 1, 6),
 (1, 0, 10, 0, 2, 10),
 (2, 0, 2, 0, 0, 9),
 (2, 0, 2, 0, 1, 6),
 (2, 0, 2, 0, 2, 10)]

In [49]:
%%sql
SELECT A.i, B.j, SUM(A.val*B.val) AS val
FROM A,B
WHERE A.j = B.i
GROUP BY A.i, B.j;

 * sqlite:///PS1.db
Done.

[(0, 0, 106),
 (0, 1, 80),
 (0, 2, 171),
 (1, 0, 146),
 (1, 1, 109),
 (1, 2, 212),
 (2, 0, 23),
 (2, 1, 17),
 (2, 2, 55)]

### Part (d): Matrix power [10 points]

The power $A^n$ of a matrix $A$ is defined as the matrix product of $n$ copies of $A$. 

Write a _single SQL query_ that computes the **fourth power** of matrix $A$, in other words, $A^4 = A \cdot A \cdot A \cdot A$:

In [ ]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[(0, 0, 27149),
 (0, 1, 16290),
 (0, 2, 31916),
 (1, 0, 36892),
 (1, 1, 22221),
 (1, 2, 43134),
 (2, 0, 5284),
 (2, 1, 3080),
 (2, 2, 6465)]

In [69]:
%%sql
WITH X AS (
	SELECT A.i, B.j, SUM(A.val*B.val) AS val
	FROM A,B
	WHERE A.j = B.i
	GROUP BY A.i, B.j
),Y AS (
	SELECT A.i, B.j, SUM(A.val*B.val) AS val
	FROM A,B
	WHERE A.j = B.i
	GROUP BY A.i, B.j
)
SELECT X.i, Y.j, SUM(X.val*Y.val) AS val
FROM X,Y
WHERE X.j = Y.i
GROUP BY X.i, Y.j;

 * sqlite:///PS1.db
Done.

[(0, 0, 26849),
 (0, 1, 20107),
 (0, 2, 44491),
 (1, 0, 36266),
 (1, 1, 27165),
 (1, 2, 59734),
 (2, 0, 6185),
 (2, 1, 4628),
 (2, 2, 10562)]

# Problem 2: The Sales Database [25 points]
----------------------------------------------

We've prepared and loaded a dataset related to sales data from a company. The dataset has the following schema:

> `Holidays (WeekDate, IsHoliday)`

> `Stores (Store, Type, Size)`

> `TemporalData(Store, WeekDate, Temperature, FuelPrice, CPI, UnemploymentRate)`

> `Sales (Store, Dept, WeekDate, WeeklySales)`

Before you start writing queries on the database, find the schema and the constraints (keys, foreign keys).

## Holidays

In [106]:
%sql SELECT * FROM Holidays LIMIT 1

 * sqlite:///PS1.db
Done.

[('2010-02-05', 'FALSE')]

In [71]:
%%sql 
PRAGMA table_info(Holidays);

 * sqlite:///PS1.db
Done.

[(0, 'weekdate', 'DATE', 0, None, 1), (1, 'isholiday', 'BOOLEAN', 0, None, 0)]

## Stores

In [72]:
%sql PRAGMA table_info(Stores);

 * sqlite:///PS1.db
Done.

[(0, 'store', 'INTEGER', 0, None, 1),
 (1, 'type', 'CHAR(1)', 0, None, 0),
 (2, 'size', 'INTEGER', 0, None, 0)]

## Temporal Data

In [75]:
%sql PRAGMA table_info(TemporalData);

 * sqlite:///PS1.db
Done.

[(0, 'store', 'INTEGER', 0, None, 1),
 (1, 'weekdate', 'DATE', 0, None, 2),
 (2, 'temperature', 'REAL', 0, None, 0),
 (3, 'fuelprice', 'REAL', 0, None, 0),
 (4, 'cpi', 'REAL', 0, None, 0),
 (5, 'unemploymentrate', 'REAL', 0, None, 0)]

## Sales

In [5]:
%sql SELECT * FROM sales LIMIT 5

 * sqlite:///PS1.db
Done.

[(1, 1, '2010-02-05', 24924.5),
 (1, 1, '2010-02-12', 46039.49),
 (1, 1, '2010-02-19', 41595.55),
 (1, 1, '2010-02-26', 19403.54),
 (1, 1, '2010-03-05', 21827.9)]

In [76]:
%sql PRAGMA table_info(sales);

 * sqlite:///PS1.db
Done.

[(0, 'store', 'INTEGER', 0, None, 1),
 (1, 'dept', 'INTEGER', 0, None, 2),
 (2, 'weekdate', 'DATE', 0, None, 3),
 (3, 'weeklysales', 'REAL', 0, None, 0)]

### Part (a): Sales during Holidays [10 points]

Using a _single SQL query_, find the store(s) with the largest overall sales during holiday weeks. Further requirements:
* Use the `WITH` clause before the main body of the query to compute a subquery if necessary.
* Return a relation with schema `(Store, AllSales)`.

Write your query here:

In [ ]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[(20, 22490350.81000001)]

In [18]:
%%sql
WITH H AS (
	SELECT *
	FROM Holidays 
	WHERE isholiday = 'TRUE'),
	M AS (
	SELECT S.Store AS Store, SUM(weeklysales) AS AllSales
	FROM H, Sales S
	WHERE H.weekdate = S.weekdate
	GROUP BY S.store 
	)
SELECT Store, MAX(AllSales) AS AllSales
FROM M

 * sqlite:///PS1.db
Done.

[(20, 22490350.81000001)]

### Part (b): When Holidays do not help Sales [10 points]

Using a _single SQL query_, compute the **number** of non-holiday weeks that had larger sales than the overall average sales during holiday weeks. Further requirements:
* Use the `WITH` clause before the main body of the query to compute a subquery if necessary.
* Return a relation with schema `(NumNonHolidays)`.

Write your query here:

In [ ]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(8,)]

In [69]:
%%sql
WITH H AS (SELECT weekdate 
			FROM Holidays 
			WHERE isholiday = 'TRUE')
SELECT SUM(weeklysales) AS weeklysum
FROM H, sales
WHERE sales.weekdate = H.weekdate
GROUP BY H.weekdate

 * sqlite:///PS1.db
Done.

[(48336677.63000006,),
 (45634397.840000056,),
 (65821003.240000084,),
 (40432519.000000075,),
 (47336192.78999979,),
 (46763227.53000005,),
 (66593605.25999993,),
 (46042461.03999984,),
 (50009407.91999999,),
 (48330059.30999995,)]

In [90]:
%%sql
WITH avg AS (
	WITH weeklysum AS (
		WITH H AS (SELECT weekdate 
					FROM Holidays 
					WHERE isholiday = 'TRUE')
		SELECT SUM(weeklysales) AS weeklysum
		FROM H, sales
		WHERE sales.weekdate = H.weekdate
		GROUP BY H.weekdate
	)
	SELECT avg(weeklysum) AS avg
	FROM weeklysum
), nonholiday AS (
		WITH H AS (SELECT weekdate 
					FROM Holidays 
					WHERE isholiday = 'FALSE')
		SELECT SUM(weeklysales) AS weeklysum
		FROM H, sales
		WHERE sales.weekdate = H.weekdate
		GROUP BY H.weekdate)
SELECT COUNT(*) AS NumNonHolidays
FROM nonholiday, avg
WHERE weeklysum > avg

 * sqlite:///PS1.db
Done.

[(8,)]

### Part (c): Total Summer Sales [5 points]

Using a _single SQL query_, compute the total sales during summer (months 6,7,and 8) for each type of store. Further requirements:
* Return a relation with schema `(type, TotalSales)`.

*Hint:* SQLite3 does not support native operations on the DATE datatype. To create a workaround, you can use the `LIKE` predicate and the string concatenation operator (||). You can also use the substring operator that SQLite3 supports (`substr`).

Write your query here:

In [ ]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[('A', 1211554899.8500097),
 ('B', 561610722.3999932),
 ('C', 112555450.65999933)]

In [104]:
%%sql
SELECT store, SUM(weeklysales)
FROM sales
WHERE weekdate LIKE '%-06-%' 
OR weekdate LIKE '%-07-%'
OR weekdate LIKE '%-08-%'
GROUP BY store
LIMIT 1

 * sqlite:///PS1.db
Done.

[(1, 61124278.330000006)]

In [108]:
%%sql
WITH storeWeekly AS (
	SELECT store, SUM(weeklysales) AS weekSum
	FROM sales
	WHERE weekdate LIKE '%-06-%' 
	OR weekdate LIKE '%-07-%'
	OR weekdate LIKE '%-08-%'
	GROUP BY store
)
SELECT type, SUM(weekSum) AS TotalSales
FROM stores, storeWeekly
WHERE stores.store = storeWeekly.store
GROUP BY type

 * sqlite:///PS1.db
Done.

[('A', 1211554899.8500001),
 ('B', 561610722.3999997),
 ('C', 112555450.66000009)]

# Problem 3: The Traveling SQL Server Salesman Problem [25 points]
--------------------------------------------------

SQL Server salespeople are lucky as far as traveling salespeople go- they only have to sell one or two big enterprise contracts, at one or two offices in Wisconsin, in order to make their monthly quota!

Answer the following questions using the table of streets connecting company office buildings.

**Note that for convenience all streets are included _twice_, as $A \rightarrow B$ and $B \rightarrow A$.  This should make some parts of the problem easier, but remember to take it into account!**

In [156]:
%sql SELECT * FROM streets WHERE A = 'UW' LIMIT 10;

 * sqlite:///PS1.db
Done.

[(2, 'R', 'Gadget Corp', 'UW-Madison', 6),
 (3, 'F', 'Gadget Corp', 'DooHickey Corp', 3),
 (7, 'F', 'Gadget Corp', 'Gadget Industries', 9)]

### Part (a): One-hop, two-hop, three-hop... [10 points]

Our salesperson has stopped at UW-Madison, to steal some cool new RDBMS technology from CS564-ers, and now wants to go sell it to a company _within 9 miles of UW-Madison and _passing through no more than 3 distinct streets_.  Write a single query, not using `WITH` (see later on), to find all such companies.

Your query should return the schema `(company, distance)` where distance is cumulative from UW-Madison.

Write your query here:

In [ ]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[('DooHickey Collective', 7),
 ('DooHickey Corp', 9),
 ('Gadget Collective', 9),
 ('Gadget Corp', 6),
 ('Gizmo Corp', 9)]

In [251]:
%%sql 
SELECT B AS company, d AS distance
FROM streets
WHERE A = 'UW-Madison'
AND d <= 9
UNION
SELECT S2.B AS company, (S2.d + S1.d) AS distance
FROM streets S1, streets S2
WHERE S1.B = S2.A
AND S1.A = 'UW-Madison'
AND distance <= 9
UNION 
SELECT S3.B AS company, (S3.d + S2.d + S1.d) AS distance
FROM streets S1, streets S2, streets S3
WHERE S1.B = S2.A
AND S2.B = S3.A
AND S1.A = 'UW-Madison'
AND distance <= 9

 * sqlite:///PS1.db
Done.

[('DooHickey Collective', 7),
 ('DooHickey Corp', 9),
 ('Gadget Collective', 9),
 ('Gadget Corp', 6),
 ('Gizmo Corp', 9)]

In [203]:
%%sql 
SELECT S3.A, (S1.d + S2.d) AS distance
FROM streets S1, streets S2, streets S3
WHERE S1.A = 'UW-Madison'
AND S1.B = S2.A
AND S2.B = S3.A
AND distance <= 9

 * sqlite:///PS1.db
Done.

[('Gizmo Corp', 9),
 ('Gizmo Corp', 9),
 ('Gizmo Corp', 9),
 ('DooHickey Corp', 9),
 ('DooHickey Corp', 9),
 ('DooHickey Corp', 9)]

In [ ]:
%%sql 
SELECT DISTINCT S1.A, S2.A, S3.A, S1.id, S2.id, S3.id, (S1.d + s2.d) AS dist
FROM streets S1, streets S2, streets S3
WHERE S1.B = S2.A 
AND S2.B = S3.A 
AND dist <= 9

In [109]:
%%sql
SELECT B AS company, d AS distance
FROM streets
WHERE A = 'UW-Madison'
AND distance <= 9

 * sqlite:///PS1.db
Done.

[('DooHickey Collective', 7), ('Gadget Corp', 6), ('Gadget Collective', 9)]

### Part (b): A stop at the Farm [10 points]

Now, our salesperson is out in the field, and wants to see all routes- and their distances- which will take him/her from a company $A$ to a company $B$, with the following constraints:
* The route must pass through UW-Madison (in order to pick up new RDBMS tech to sell!)
* $A$ and $B$ must _each individually_ be within 2 hops of UW-Madison
* $A$ and $B$ must be different companies
* _The total distance must be $<= 15$_
* Do not use `WITH`
* If you return a path $A \rightarrow B$, _do not include_ $B \rightarrow A$ in your answer!

In order to make your answer a bit cleaner, you may split into two queries, one of which creates a `VIEW`.  A view is a virtual table based on the output set of a SQL query.  A view can be used just like a normal table- the only difference under the hood is that the DBMS re-evaluates the query used to generate it each time a view is queried by a user (thus the data is always up-to date!)

Here's a simple example of a view:

In [6]:
%%sql 
DROP VIEW IF EXISTS short_streets;
CREATE VIEW short_streets AS 
SELECT A, B, d FROM streets WHERE d < 3;
SELECT * FROM short_streets LIMIT 3;

 * sqlite:///PS1.db
Done.
Done.
Done.

[('DooHickey Collective', 'Gizmo Corp', 2),
 ('Gizmo Corp', 'DooHickey Collective', 2),
 ('Gizmo Corp', 'Widget Industries', 1)]

Write your query or queries here:

In [ ]:

"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.
Done.
Done.

[('Gadget Corp', 'DooHickey Collective', 13),
 ('Gadget Corp', 'DooHickey Corp', 15),
 ('Gadget Corp', 'Gadget Collective', 15),
 ('Gizmo Corp', 'Gadget Corp', 15)]

In [228]:
%%sql 
SELECT *
FROM Streets
WHERE A = 'Gizmo Corp'

 * sqlite:///PS1.db
Done.

[(1, 'R', 'Gizmo Corp', 'DooHickey Collective', 2),
 (4, 'F', 'Gizmo Corp', 'GadgetWorks', 8),
 (6, 'F', 'Gizmo Corp', 'Widget Industries', 1)]

### Part (c): Finding Triangles [5 points]

Finally, our salesperson wants to find a route that goes from company $A$ to company $B$ to company $C$ and then back to company $A$ with the following constraints:
* $A$, $B$, $C$ must be different companies
* Do not use `WITH` 
* Output each such route that you find once (use the id's as a way to break ties)
* Output the distance of the route

Write your query here:

In [ ]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[('Thing Industries', 'Widget Collective', 'GadgetCo', 18)]

In [230]:
%%sql
DROP VIEW IF EXISTS triangle;
CREATE VIEW triangle AS 
SELECT S1.A AS A, S2.A AS B, S3.A AS C, (S1.d + S2.d + S3.d) AS distance, (S1.id+S2.id+S3.id) AS id_sum
FROM streets S1, streets S2, streets S3
WHERE S1.B = S2.A
AND S2.B = S3.A
AND S3.B = S1.A
AND S1.direction = "F"
AND S2.direction = "F"
AND S3.direction = "F";
SELECT A, B, C, distance
FROM triangle
GROUP BY id_sum;

 * sqlite:///PS1.db
Done.
Done.
Done.

[('Thing Industries', 'Widget Collective', 'GadgetCo', 18)]

In [208]:
%%sql
SELECT * FROM streets LIMIT 1

 * sqlite:///PS1.db
Done.

[(0, 'F', 'UW-Madison', 'DooHickey Collective', 7)]